
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cosmosdb_account.openai will be created
  + resource "azurerm_cosmosdb_account" "openai" {
      + access_key_metadata_writes_enabled       = true
      + analytical_storage_enabled               = false
      + connection_strings                       = (sensitive value)
      + create_mode                              = (known after apply)
      + default_identity_type                    = "FirstPartyIdentity"
      + enable_automatic_failover                = false
      + enable_free_tier                         = false
      + enable_multiple_write_locations          = false
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + is_virtual_network_filter_enabled        = false
      + kind                                     = "GlobalDocumentDB"
      + local_authentication_disabled            = false
      + location                                 = "uksouth"
      + mongo_server_version                     = (known after apply)
      + name                                     = "et-npd-openai-cosmos"
      + network_acl_bypass_for_azure_services    = false
      + offer_type                               = "Standard"
      + primary_key                              = (sensitive value)
      + primary_readonly_key                     = (sensitive value)
      + primary_readonly_sql_connection_string   = (sensitive value)
      + primary_sql_connection_string            = (sensitive value)
      + public_network_access_enabled            = true
      + read_endpoints                           = (known after apply)
      + resource_group_name                      = "ET-NPD-OpenAI"
      + secondary_key                            = (sensitive value)
      + secondary_readonly_key                   = (sensitive value)
      + secondary_readonly_sql_connection_string = (sensitive value)
      + secondary_sql_connection_string          = (sensitive value)
      + write_endpoints                          = (known after apply)

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 300
          + max_staleness_prefix    = 100000
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "uksouth"
          + zone_redundant    = false
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_linux_web_app.openai will be created
  + resource "azurerm_linux_web_app" "openai" {
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + hosting_environment_id            = (known after apply)
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "et-npd-openai-wapp"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "ET-NPD-OpenAI"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (sensitive value)
      + zip_deploy_file                   = (known after apply)

      + site_config {
          + always_on                               = true
          + app_command_line                        = "node server.js"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }
        }
    }

  # azurerm_service_plan.openai will be created
  + resource "azurerm_service_plan" "openai" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "et-npd-openai-asp"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "ET-NPD-OpenAI"
      + sku_name                     = "B1"
      + worker_count                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
